Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public void SetGeometryCurve(
	Curve curve,
	bool overrideJoins
)
  Visual Basic
Public Sub SetGeometryCurve ( _
	curve As Curve, _
	overrideJoins As Boolean _
)
  Visual C++
public:
void SetGeometryCurve(
	Curve^ curve,
	bool overrideJoins
)
 Parameters
  curve
 Type:  Autodesk.Revit.DB Curve
  overrideJoins
 Type:  System Boolean
 See Also
  CurveElement Class
  Autodesk.Revit.DB Namespace